# KONVERSI NILAI NUMERIK KE DALAM SEJUMLAH KATEGORI ###

## Import Modules ###

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

## Persiapan Data Frame ##

In [3]:
n_rows = 10
n_cols = 1
cols = ('usia',)

df = pd.DataFrame(np.random.randint(1, 99, size=(n_rows, n_cols)),
                 columns=cols)
df

   usia
0    13
1    29
2    31
3    97
4    23
5    49
6    15
7    82
8    39
9    58

## Pengelompokkan Nilai Numerik Ke Dalam Beberapa Kategori Menggunakan cut() ##

In [4]:
df['kelompok_usia'] = pd.cut(df['usia'],
                             bins = [0, 18, 65, 99],
                             labels = ['anak', 'dewasa', 'manula'])
df

   usia kelompok_usia
0    13          anak
1    29        dewasa
2    31        dewasa
3    97        manula
4    23        dewasa
5    49        dewasa
6    15          anak
7    82        manula
8    39        dewasa
9    58        dewasa